import React, { useState, useEffect } from 'react';
import Typography from '@mui/material/Typography';
import Box from '@mui/material/Box';
import { Card } from '@mui/material';

const notificationsData = [
    {
        id: 1,
        date: '05-06',
        message: 'Увага! Завтра, 7 травня, у зв\'язку з технічними роботами, сайт може бути тимчасово недоступний. Просимо вибачення за незручності.',
    },
    {
        id: 2,
        date: '05-08',
        message: 'Шановні батьки майбутніх першокласників! Запрошуємо вас на онлайн-зустріч 15 травня о 18:00. Деталі будуть надіслані на електронну пошту.',
    },
    {
        id: 3,
        date: '05-10',
        message: 'Нове надходження книг! Запрошуємо учнів ознайомитися з новими науково-популярними виданнями та захопливими романами.',
    },
    {
        id: 4,
        date: '05-12',
        message: 'Оголошується набір до секції з футболу для учнів 5-7 класів. Перше тренування відбудеться 20 травня о 15:00 на шкільному стадіоні.',
    },
    {
        id: 5,
        date: '05-15',
        message: 'Увага! Конкурс малюнків "Моя квітуча Україна" триває до кінця травня. Запрошуємо всіх охочих взяти участь!',
    },
    {
        id: 6,
        date: '05-17',
        message: 'Нагадую про батьківські збори, які відбудуться 22 травня о 18:30 в актовій залі. Явка обов\'язкова.',
    },
    {
        id: 7,
        date: '05-19',
        message: 'Запрошуємо всіх учнів взяти участь у голосуванні за проєкт покращення шкільного подвір\'я. Бюлетені будуть доступні у холі першого поверху з 25 травня.',
    },
    {
        id: 8,
        date: '05-21',
        message: 'Оголошується додатковий набір на безкоштовні підготовчі курси до ДПА з математики для учнів 11 класів. Запис за посиланням на сайті.',
    },
    {
        id: 9,
        date: '05-23',
        message: 'Просимо батьків надати оновлені медичні довідки учнів до 1 червня. Дякуємо за співпрацю.',
    },
    {
        id: 10,
        date: '05-26',
        message: 'Вітаємо всіх учнів та вчителів з успішним завершенням навчального року! Бажаємо гарних літніх канікул!',
    },
];

const GenerationCard = () => {


    return (
        <Card>

        </Card>
    )
}

export default GenerationCard